def castle_guard_and_questions():
    print('И финал - ты должен пройти замок 🏰!!! :о')
    print('Ты идёшь к воротам замка. Но дорогу тебе преграждает стражник! Он говорит, что ты почему-то должен отгадывать какие-то загадки. Он говорит первую загадку...')
    print('Первая загадка: Что громче всего орёт утром в понедельник?')
    answer = input('Твой ответ:  ').strip().lower()
    if answer == "будильник":
        print('Верный ответ! Следующая загадка -> Что всегда заканчивается в самый нужный момент (связано с частями телефона) ?')
        answer = input('Твой ответ:  ').strip().lower()
    else:
        print('Неправильно! 💀. ТЫ ПРОИГРАЛ !!! :о')
        exit()
    if answer == 'батарея':
        print('Хорош! Уже 2 загадки подряд! Следующая загадка -> Что лежит в портфеле и весит как кирпич, но по факту просто сборник ненужной инфы?')
        answer = input('Твой ответ:   ').strip().lower()
    else:
        print('Неправильно! 💀. ТЫ ПРОИГРАЛ !!! :о')
        exit()
    if answer == 'учебник':
        print("И опять правильно!")
        print('Что все обещают сделать днём или вечером, а делают в 23:59?')
        answer = input('Твой ответ:   ').strip().lower()
    else:
        print('Неправильно! 💀. ТЫ ПРОИГРАЛ !!! :о')
        exit()
    if answer == 'домашка':
        print('Правильно! 4 вопроса подряд!')
        print('Что звенит и значит: «ТЫ ОПОЗДАЛ, ЕСЛИ ТЫ НЕ В КЛАССЕ!!!»?')
        answer = input('Твой ответ:   ').strip().lower()
    else:
        print('Неправильно! 💀. ТЫ ПРОИГРАЛ !!! :о')
        exit()
    if answer == 'звонок':
        print('ТЫ УГАДАЛ ВСЕ ЗАГАДКИ!!! ТЫ ПРОШЁЛ В ЗАМОК И ВЫИГРАЛ КВЕСТ!!! 🎉🎉🎊🎊🥳🥳')
        exit()
    else:
        print('Неправильно! 💀. ТЫ ПРОИГРАЛ !!! :о')
        exit()
